micropython/micropython/ports/psoc-edge/machine_i2c.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2022-2026 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// std includes
#include <stdio.h>
#include <string.h>


// mpy includes
#include "extmod/modmachine.h"
#include "py/runtime.h"
#include "py/mphal.h"
#include "py/mperrno.h"


// MTB includes
#include "cybsp.h"
#include "cy_scb_i2c.h"


// port-specific includes
#include "genhdr/pins_af.h"
#include "modmachine.h"
#include "machine_scb.h"

#define DEBUG_printf(...) // printf(__VA_ARGS__)

#define DEFAULT_I2C_FREQ     (400000)

#define i2c_assert_raise_val(msg, ret)   if (ret != CY_RSLT_SUCCESS) { \
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT(msg), ret); \
}

typedef struct _machine_hw_i2c_obj_t {
    mp_obj_base_t base;
    int id; // This parameter is unused and added for compliance with reference API.
    mp_hal_pin_obj_t scl;
    mp_hal_pin_obj_t sda;
    uint32_t freq;
    uint32_t timeout;
    machine_scb_obj_t *scb_obj;
    cy_stc_scb_i2c_config_t cfg;   // PDL I2C configuration
    cy_stc_scb_i2c_context_t ctx;  // PDL I2C runtime context
} machine_hw_i2c_obj_t;

machine_hw_i2c_obj_t *machine_hw_i2c_obj[MICROPY_PY_MACHINE_I2C_NUM_ENTRIES] = { NULL };

static inline machine_hw_i2c_obj_t *machine_hw_i2c_obj_alloc(void) {
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_I2C_NUM_ENTRIES; i++)
    {
        if (machine_hw_i2c_obj[i] == NULL) {
            machine_hw_i2c_obj[i] = mp_obj_malloc(machine_hw_i2c_obj_t, &machine_i2c_type);
            return machine_hw_i2c_obj[i];
        }
    }

    return NULL;
}

static inline void machine_hw_i2c_obj_free(machine_hw_i2c_obj_t *i2c_obj_ptr) {
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_I2C_NUM_ENTRIES; i++)
    {
        if (machine_hw_i2c_obj[i] == i2c_obj_ptr) {
            machine_hw_i2c_obj[i] = NULL;
        }
    }
}

static void machine_hw_i2c_scb_isr(mp_obj_t hw_i2c_obj) {
    machine_hw_i2c_obj_t *self = MP_OBJ_TO_PTR(hw_i2c_obj);
    Cy_SCB_I2C_MasterInterrupt(self->scb_obj->scb, &self->ctx);
}

static void machine_hw_i2c_init(machine_hw_i2c_obj_t *self, uint32_t freq_hz) {
    cy_rslt_t result;

    self->cfg = (cy_stc_scb_i2c_config_t) {
        .i2cMode = CY_SCB_I2C_MASTER,
        .useRxFifo = false,
        .useTxFifo = true,
        .slaveAddress = 0U,
        .slaveAddressMask = 0U,
        .acceptAddrInFifo = false,
        .ackGeneralAddr = false,
        .enableWakeFromSleep = false,
        .enableDigitalFilter = false,
        .lowPhaseDutyCycle = 8U,
        .highPhaseDutyCycle = 8U,
    };

    const mp_hal_pin_af_config_t i2c_pins_config[] = {
        MP_HAL_PIN_AF_CONF_INIT(self->scl, CY_GPIO_DM_OD_DRIVESLOW, 1, MACHINE_PIN_AF_SIGNAL_I2C_SCL),
        MP_HAL_PIN_AF_CONF_INIT(self->sda, CY_GPIO_DM_OD_DRIVESLOW, 1, MACHINE_PIN_AF_SIGNAL_I2C_SDA),
    };

    machine_pin_af_unit_t af_unit = MACHINE_PIN_AF_UNIT_NONE;
    mp_hal_periph_pins_af_resolve_fn_unit(i2c_pins_config, 2, MACHINE_PIN_AF_FN_I2C, &af_unit);

    self->scb_obj = machine_scb_obj_alloc(af_unit, self, machine_hw_i2c_scb_isr);

    mp_hal_periph_pins_af_init(i2c_pins_config, 2);

    result = Cy_SCB_I2C_Init(self->scb_obj->scb, &self->cfg, &self->ctx);
    i2c_assert_raise_val("I2C init failed: 0x%lx", result);

    // For desired data rate, clk_scb frequency must be in valid range (see TRM I2C Oversampling section)
    // For 100kHz: clk_scb range is 1.55 - 3.2 MHz (architecture reference manual 002-38331 Rev. P685 table 355)
    //   - clk_peri = 100 MHz, divider = 42 → clk_scb = 2.38 MHz ✓ (mid-range)
    // For 400kHz: clk_scb range is 7.82 - 10 MHz
    //   - clk_peri = 100 MHz, divider = 11 → clk_scb = 9.09 MHz ✓ (within range)
    // Note: Cy_SysClk_PeriphSetDivider takes (divider - 1), so divider=11 → value=10
    /* Connect assigned divider to be a clock source for I2C */
    Cy_SysClk_PeriphAssignDivider(self->scb_obj->clk, CY_SYSCLK_DIV_8_BIT, 2U);
    uint32_t divider = (freq_hz <= 100000) ? 41U : 10U;
    Cy_SysClk_PeriphSetDivider(CY_SYSCLK_DIV_8_BIT, 2U, divider);
    Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_8_BIT, 2U);

    uint32_t clk_scb_freq = Cy_SysClk_PeriphGetFrequency(CY_SYSCLK_DIV_8_BIT, 2U);
    DEBUG_printf("DEBUG: clk_scb_freq=%u Hz\n", clk_scb_freq);

    uint32_t actual_rate = Cy_SCB_I2C_SetDataRate(self->scb_obj->scb, freq_hz, clk_scb_freq);
    DEBUG_printf("DEBUG: actual_rate=%u Hz (requested=%u Hz)\n", actual_rate, freq_hz);

    if ((actual_rate > freq_hz) || (actual_rate == 0U)) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("cannot reach desired I2C data rate %u Hz (actual: %u Hz)"),
            freq_hz, actual_rate);
    }

    sys_int_init(&(self->scb_obj->irq));

    Cy_SCB_I2C_Enable(self->scb_obj->scb);

    DEBUG_printf("I2C initialized: requested=%u Hz, actual=%u Hz, clk_scb=%u Hz\n",
        freq_hz, actual_rate, clk_scb_freq);

    self->freq = freq_hz;
}


static void machine_hw_i2c_deinit(mp_obj_base_t *self_in) {
    machine_hw_i2c_obj_t *self = MP_OBJ_TO_PTR(self_in);

    Cy_SCB_I2C_Disable(self->scb_obj->scb, &self->ctx);
    sys_int_deinit(&self->scb_obj->irq);
    Cy_SysClk_PeriphDisableDivider(CY_SYSCLK_DIV_8_BIT, 0U);

    machine_scb_obj_free(self->scb_obj);
    machine_hw_i2c_obj_free(self);
}

static int machine_hw_i2c_transfer(mp_obj_base_t *self_in, uint16_t addr, size_t len, uint8_t *buf, unsigned int flags) {
    machine_hw_i2c_obj_t *self = MP_OBJ_TO_PTR(self_in);
    cy_rslt_t result;

    DEBUG_printf("I2C Transfer: addr=0x%02X, len=%u, flags=0x%02X (%s)\n",
        addr, len, flags, (flags & MP_MACHINE_I2C_FLAG_READ) ? "READ" : "WRITE");

    cy_stc_scb_i2c_master_xfer_config_t transfer;
    transfer.slaveAddress = addr;
    transfer.buffer = buf;
    transfer.bufferSize = len;
    // Generate Stop condition if MP_MACHINE_I2C_FLAG_STOP is set
    transfer.xferPending = !(flags & MP_MACHINE_I2C_FLAG_STOP);

    if (flags & MP_MACHINE_I2C_FLAG_READ) {
        result = Cy_SCB_I2C_MasterRead(self->scb_obj->scb, &transfer, &self->ctx);
    } else {
        result = Cy_SCB_I2C_MasterWrite(self->scb_obj->scb, &transfer, &self->ctx);
    }

    if (result != CY_RSLT_SUCCESS) {
        DEBUG_printf("I2C Transfer start failed: 0x%lx\n", result);
        return -MP_EIO;  // I/O error
    }

    DEBUG_printf("I2C Transfer started, waiting for completion...\n");

    uint32_t start_time = mp_hal_ticks_us();
    uint32_t timeout_end = start_time + self->timeout;  // Both in microseconds

    while (0UL != (CY_SCB_I2C_MASTER_BUSY & Cy_SCB_I2C_MasterGetStatus(self->scb_obj->scb, &self->ctx))) {
        // Yield to allow other tasks/interrupts to run
        mp_event_handle_nowait();

        // Check for timeout using actual elapsed time
        if (mp_hal_ticks_us() >= timeout_end) {
            DEBUG_printf("I2C Transfer timeout after %u us!\n", self->timeout);
            return -MP_ETIMEDOUT;
        }
    }

    uint32_t master_status = Cy_SCB_I2C_MasterGetStatus(self->scb_obj->scb, &self->ctx);

    DEBUG_printf("I2C Transfer complete, status=0x%08lX\n", master_status);

    if (master_status & CY_SCB_I2C_MASTER_ERR) {
        DEBUG_printf("I2C Transfer error detected in status\n");
        return -MP_EIO;  // I/O error
    }

    return len;
}

void machine_hw_i2c_deinit_all(void) {
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_I2C_NUM_ENTRIES; i++)
    {
        if (machine_hw_i2c_obj[i] != NULL) {
            machine_hw_i2c_deinit((mp_obj_base_t *)machine_hw_i2c_obj[i]);
        }
    }
}

/******************************************************************************/
// MicroPython bindings for machine API

static void machine_hw_i2c_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_hw_i2c_obj_t *self = MP_OBJ_TO_PTR(self_in);

    // Print I2C configuration
    mp_printf(print, "I2C(scl='%q', sda='%q', freq=%u, timeout=%u)",
        self->scl->name,
        self->sda->name,
        self->freq,
        self->timeout);
}

mp_obj_t machine_hw_i2c_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    mp_arg_check_num(n_args, n_kw, 0, 5, true);

    enum { ARG_id, ARG_scl, ARG_sda, ARG_freq, ARG_timeout };

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_id,   MP_ARG_INT, {.u_int = -1}},
        { MP_QSTR_scl, MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_sda, MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_freq, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_I2C_FREQ} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 50000} }  // Default 50000us (50ms)
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    machine_hw_i2c_obj_t *self = machine_hw_i2c_obj_alloc();
    if (self == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("machine.I2C: maximum number of I2C instances reached"));
    }

    if (args[ARG_id].u_int != -1) {
        self->id = args[ARG_id].u_int;
        DEBUG_printf("machine.I2C: ID parameter is ignored in this port.\n");
    }

    self->scl = mp_hal_get_pin_obj(args[ARG_scl].u_obj);
    self->sda = mp_hal_get_pin_obj(args[ARG_sda].u_obj);

    self->timeout = args[ARG_timeout].u_int;
    if (self->timeout == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("machine.I2C: timeout must be > 0"));
    }

    nlr_buf_t nlr;
    if (nlr_push(&nlr) == 0) {
        machine_hw_i2c_init(self, args[ARG_freq].u_int);
        nlr_pop();
    } else {
        // Initialization failed, clean up
        machine_hw_i2c_obj_free(self);
        nlr_jump(nlr.ret_val);
    }

    return MP_OBJ_FROM_PTR(self);
}

static const mp_machine_i2c_p_t machine_hw_i2c_p = {
    .deinit = machine_hw_i2c_deinit,
    .transfer = mp_machine_i2c_transfer_adaptor,
    .transfer_single = machine_hw_i2c_transfer,
};

MP_DEFINE_CONST_OBJ_TYPE(
    machine_i2c_type,
    MP_QSTR_I2C,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_i2c_make_new,
    print, machine_hw_i2c_print,
    protocol, &machine_hw_i2c_p,
    locals_dict, &mp_machine_i2c_locals_dict
    );
